Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/include/component/sdhc.h
/* -------- SDHC_NISTER : (SDHC Offset: 0x34) (R/W 16) Normal Interrupt Status Enable -------- */
#define SDHC_NISTER_RESETVALUE                _UINT16_(0x00)                                       /*  (SDHC_NISTER) Normal Interrupt Status Enable  Reset Value */

#define SDHC_NISTER_CMDC_Pos                  _UINT16_(0)                                          /* (SDHC_NISTER) Command Complete Status Enable Position */
#define SDHC_NISTER_CMDC_Msk                  (_UINT16_(0x1) << SDHC_NISTER_CMDC_Pos)              /* (SDHC_NISTER) Command Complete Status Enable Mask */
#define SDHC_NISTER_CMDC(value)               (SDHC_NISTER_CMDC_Msk & (_UINT16_(value) << SDHC_NISTER_CMDC_Pos)) /* Assigment of value for CMDC in the SDHC_NISTER register */
#define   SDHC_NISTER_CMDC_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CMDC_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CMDC_MASKED               (SDHC_NISTER_CMDC_MASKED_Val << SDHC_NISTER_CMDC_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CMDC_ENABLED              (SDHC_NISTER_CMDC_ENABLED_Val << SDHC_NISTER_CMDC_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_TRFC_Pos                  _UINT16_(1)                                          /* (SDHC_NISTER) Transfer Complete Status Enable Position */
#define SDHC_NISTER_TRFC_Msk                  (_UINT16_(0x1) << SDHC_NISTER_TRFC_Pos)              /* (SDHC_NISTER) Transfer Complete Status Enable Mask */
#define SDHC_NISTER_TRFC(value)               (SDHC_NISTER_TRFC_Msk & (_UINT16_(value) << SDHC_NISTER_TRFC_Pos)) /* Assigment of value for TRFC in the SDHC_NISTER register */
#define   SDHC_NISTER_TRFC_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_TRFC_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_TRFC_MASKED               (SDHC_NISTER_TRFC_MASKED_Val << SDHC_NISTER_TRFC_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_TRFC_ENABLED              (SDHC_NISTER_TRFC_ENABLED_Val << SDHC_NISTER_TRFC_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_BLKGE_Pos                 _UINT16_(2)                                          /* (SDHC_NISTER) Block Gap Event Status Enable Position */
#define SDHC_NISTER_BLKGE_Msk                 (_UINT16_(0x1) << SDHC_NISTER_BLKGE_Pos)             /* (SDHC_NISTER) Block Gap Event Status Enable Mask */
#define SDHC_NISTER_BLKGE(value)              (SDHC_NISTER_BLKGE_Msk & (_UINT16_(value) << SDHC_NISTER_BLKGE_Pos)) /* Assigment of value for BLKGE in the SDHC_NISTER register */
#define   SDHC_NISTER_BLKGE_MASKED_Val        _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_BLKGE_ENABLED_Val       _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_BLKGE_MASKED              (SDHC_NISTER_BLKGE_MASKED_Val << SDHC_NISTER_BLKGE_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_BLKGE_ENABLED             (SDHC_NISTER_BLKGE_ENABLED_Val << SDHC_NISTER_BLKGE_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_DMAINT_Pos                _UINT16_(3)                                          /* (SDHC_NISTER) DMA Interrupt Status Enable Position */
#define SDHC_NISTER_DMAINT_Msk                (_UINT16_(0x1) << SDHC_NISTER_DMAINT_Pos)            /* (SDHC_NISTER) DMA Interrupt Status Enable Mask */
#define SDHC_NISTER_DMAINT(value)             (SDHC_NISTER_DMAINT_Msk & (_UINT16_(value) << SDHC_NISTER_DMAINT_Pos)) /* Assigment of value for DMAINT in the SDHC_NISTER register */
#define   SDHC_NISTER_DMAINT_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_DMAINT_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_DMAINT_MASKED             (SDHC_NISTER_DMAINT_MASKED_Val << SDHC_NISTER_DMAINT_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_DMAINT_ENABLED            (SDHC_NISTER_DMAINT_ENABLED_Val << SDHC_NISTER_DMAINT_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_BWRRDY_Pos                _UINT16_(4)                                          /* (SDHC_NISTER) Buffer Write Ready Status Enable Position */
#define SDHC_NISTER_BWRRDY_Msk                (_UINT16_(0x1) << SDHC_NISTER_BWRRDY_Pos)            /* (SDHC_NISTER) Buffer Write Ready Status Enable Mask */
#define SDHC_NISTER_BWRRDY(value)             (SDHC_NISTER_BWRRDY_Msk & (_UINT16_(value) << SDHC_NISTER_BWRRDY_Pos)) /* Assigment of value for BWRRDY in the SDHC_NISTER register */
#define   SDHC_NISTER_BWRRDY_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_BWRRDY_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_BWRRDY_MASKED             (SDHC_NISTER_BWRRDY_MASKED_Val << SDHC_NISTER_BWRRDY_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_BWRRDY_ENABLED            (SDHC_NISTER_BWRRDY_ENABLED_Val << SDHC_NISTER_BWRRDY_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_BRDRDY_Pos                _UINT16_(5)                                          /* (SDHC_NISTER) Buffer Read Ready Status Enable Position */
#define SDHC_NISTER_BRDRDY_Msk                (_UINT16_(0x1) << SDHC_NISTER_BRDRDY_Pos)            /* (SDHC_NISTER) Buffer Read Ready Status Enable Mask */
#define SDHC_NISTER_BRDRDY(value)             (SDHC_NISTER_BRDRDY_Msk & (_UINT16_(value) << SDHC_NISTER_BRDRDY_Pos)) /* Assigment of value for BRDRDY in the SDHC_NISTER register */
#define   SDHC_NISTER_BRDRDY_MASKED_Val       _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_BRDRDY_ENABLED_Val      _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_BRDRDY_MASKED             (SDHC_NISTER_BRDRDY_MASKED_Val << SDHC_NISTER_BRDRDY_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_BRDRDY_ENABLED            (SDHC_NISTER_BRDRDY_ENABLED_Val << SDHC_NISTER_BRDRDY_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_CINS_Pos                  _UINT16_(6)                                          /* (SDHC_NISTER) Card Insertion Status Enable Position */
#define SDHC_NISTER_CINS_Msk                  (_UINT16_(0x1) << SDHC_NISTER_CINS_Pos)              /* (SDHC_NISTER) Card Insertion Status Enable Mask */
#define SDHC_NISTER_CINS(value)               (SDHC_NISTER_CINS_Msk & (_UINT16_(value) << SDHC_NISTER_CINS_Pos)) /* Assigment of value for CINS in the SDHC_NISTER register */
#define   SDHC_NISTER_CINS_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CINS_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CINS_MASKED               (SDHC_NISTER_CINS_MASKED_Val << SDHC_NISTER_CINS_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CINS_ENABLED              (SDHC_NISTER_CINS_ENABLED_Val << SDHC_NISTER_CINS_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_CREM_Pos                  _UINT16_(7)                                          /* (SDHC_NISTER) Card Removal Status Enable Position */
#define SDHC_NISTER_CREM_Msk                  (_UINT16_(0x1) << SDHC_NISTER_CREM_Pos)              /* (SDHC_NISTER) Card Removal Status Enable Mask */
#define SDHC_NISTER_CREM(value)               (SDHC_NISTER_CREM_Msk & (_UINT16_(value) << SDHC_NISTER_CREM_Pos)) /* Assigment of value for CREM in the SDHC_NISTER register */
#define   SDHC_NISTER_CREM_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CREM_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CREM_MASKED               (SDHC_NISTER_CREM_MASKED_Val << SDHC_NISTER_CREM_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CREM_ENABLED              (SDHC_NISTER_CREM_ENABLED_Val << SDHC_NISTER_CREM_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_CINT_Pos                  _UINT16_(8)                                          /* (SDHC_NISTER) Card Interrupt Status Enable Position */
#define SDHC_NISTER_CINT_Msk                  (_UINT16_(0x1) << SDHC_NISTER_CINT_Pos)              /* (SDHC_NISTER) Card Interrupt Status Enable Mask */
#define SDHC_NISTER_CINT(value)               (SDHC_NISTER_CINT_Msk & (_UINT16_(value) << SDHC_NISTER_CINT_Pos)) /* Assigment of value for CINT in the SDHC_NISTER register */
#define   SDHC_NISTER_CINT_MASKED_Val         _UINT16_(0x0)                                        /* (SDHC_NISTER) Masked  */
#define   SDHC_NISTER_CINT_ENABLED_Val        _UINT16_(0x1)                                        /* (SDHC_NISTER) Enabled  */
#define SDHC_NISTER_CINT_MASKED               (SDHC_NISTER_CINT_MASKED_Val << SDHC_NISTER_CINT_Pos) /* (SDHC_NISTER) Masked Position  */
#define SDHC_NISTER_CINT_ENABLED              (SDHC_NISTER_CINT_ENABLED_Val << SDHC_NISTER_CINT_Pos) /* (SDHC_NISTER) Enabled Position  */
#define SDHC_NISTER_Msk                       _UINT16_(0x01FF)                                     /* (SDHC_NISTER) Register Mask  */

/* EMMC mode */
#define SDHC_NISTER_EMMC_BOOTAR_Pos           _UINT16_(14)                                         /* (SDHC_NISTER) Boot Acknowledge Received Status Enable Position */
#define SDHC_NISTER_EMMC_BOOTAR_Msk           (_UINT16_(0x1) << SDHC_NISTER_EMMC_BOOTAR_Pos)       /* (SDHC_NISTER) Boot Acknowledge Received Status Enable Mask */
#define SDHC_NISTER_EMMC_BOOTAR(value)        (SDHC_NISTER_EMMC_BOOTAR_Msk & (_UINT16_(value) << SDHC_NISTER_EMMC_BOOTAR_Pos))
#define SDHC_NISTER_EMMC_Msk                  _UINT16_(0x4000)                                      /* (SDHC_NISTER_EMMC) Register Mask  */


/* -------- SDHC_EISTER : (SDHC Offset: 0x36) (R/W 16) Error Interrupt Status Enable -------- */
#define SDHC_EISTER_RESETVALUE                _UINT16_(0x00)                                       /*  (SDHC_EISTER) Error Interrupt Status Enable  Reset Value */

