Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/include/component/sdhc.h
#define SDHC_CA1R_SDR50SUP_Pos                _UINT32_(0)                                          /* (SDHC_CA1R) SDR50 Support Position */
#define SDHC_CA1R_SDR50SUP_Msk                (_UINT32_(0x1) << SDHC_CA1R_SDR50SUP_Pos)            /* (SDHC_CA1R) SDR50 Support Mask */
#define SDHC_CA1R_SDR50SUP(value)             (SDHC_CA1R_SDR50SUP_Msk & (_UINT32_(value) << SDHC_CA1R_SDR50SUP_Pos)) /* Assigment of value for SDR50SUP in the SDHC_CA1R register */
#define   SDHC_CA1R_SDR50SUP_NO_Val           _UINT32_(0x0)                                        /* (SDHC_CA1R) SDR50 is Not Supported  */
#define   SDHC_CA1R_SDR50SUP_YES_Val          _UINT32_(0x1)                                        /* (SDHC_CA1R) SDR50 is Supported  */
#define SDHC_CA1R_SDR50SUP_NO                 (SDHC_CA1R_SDR50SUP_NO_Val << SDHC_CA1R_SDR50SUP_Pos) /* (SDHC_CA1R) SDR50 is Not Supported Position  */
#define SDHC_CA1R_SDR50SUP_YES                (SDHC_CA1R_SDR50SUP_YES_Val << SDHC_CA1R_SDR50SUP_Pos) /* (SDHC_CA1R) SDR50 is Supported Position  */
#define SDHC_CA1R_SDR104SUP_Pos               _UINT32_(1)                                          /* (SDHC_CA1R) SDR104 Support Position */
#define SDHC_CA1R_SDR104SUP_Msk               (_UINT32_(0x1) << SDHC_CA1R_SDR104SUP_Pos)           /* (SDHC_CA1R) SDR104 Support Mask */
#define SDHC_CA1R_SDR104SUP(value)            (SDHC_CA1R_SDR104SUP_Msk & (_UINT32_(value) << SDHC_CA1R_SDR104SUP_Pos)) /* Assigment of value for SDR104SUP in the SDHC_CA1R register */
#define   SDHC_CA1R_SDR104SUP_NO_Val          _UINT32_(0x0)                                        /* (SDHC_CA1R) SDR104 is Not Supported  */
#define   SDHC_CA1R_SDR104SUP_YES_Val         _UINT32_(0x1)                                        /* (SDHC_CA1R) SDR104 is Supported  */
#define SDHC_CA1R_SDR104SUP_NO                (SDHC_CA1R_SDR104SUP_NO_Val << SDHC_CA1R_SDR104SUP_Pos) /* (SDHC_CA1R) SDR104 is Not Supported Position  */
#define SDHC_CA1R_SDR104SUP_YES               (SDHC_CA1R_SDR104SUP_YES_Val << SDHC_CA1R_SDR104SUP_Pos) /* (SDHC_CA1R) SDR104 is Supported Position  */
#define SDHC_CA1R_DDR50SUP_Pos                _UINT32_(2)                                          /* (SDHC_CA1R) DDR50 Support Position */
#define SDHC_CA1R_DDR50SUP_Msk                (_UINT32_(0x1) << SDHC_CA1R_DDR50SUP_Pos)            /* (SDHC_CA1R) DDR50 Support Mask */
#define SDHC_CA1R_DDR50SUP(value)             (SDHC_CA1R_DDR50SUP_Msk & (_UINT32_(value) << SDHC_CA1R_DDR50SUP_Pos)) /* Assigment of value for DDR50SUP in the SDHC_CA1R register */
#define   SDHC_CA1R_DDR50SUP_NO_Val           _UINT32_(0x0)                                        /* (SDHC_CA1R) DDR50 is Not Supported  */
#define   SDHC_CA1R_DDR50SUP_YES_Val          _UINT32_(0x1)                                        /* (SDHC_CA1R) DDR50 is Supported  */
#define SDHC_CA1R_DDR50SUP_NO                 (SDHC_CA1R_DDR50SUP_NO_Val << SDHC_CA1R_DDR50SUP_Pos) /* (SDHC_CA1R) DDR50 is Not Supported Position  */
#define SDHC_CA1R_DDR50SUP_YES                (SDHC_CA1R_DDR50SUP_YES_Val << SDHC_CA1R_DDR50SUP_Pos) /* (SDHC_CA1R) DDR50 is Supported Position  */
#define SDHC_CA1R_DRVASUP_Pos                 _UINT32_(4)                                          /* (SDHC_CA1R) Driver Type A Support Position */
#define SDHC_CA1R_DRVASUP_Msk                 (_UINT32_(0x1) << SDHC_CA1R_DRVASUP_Pos)             /* (SDHC_CA1R) Driver Type A Support Mask */
#define SDHC_CA1R_DRVASUP(value)              (SDHC_CA1R_DRVASUP_Msk & (_UINT32_(value) << SDHC_CA1R_DRVASUP_Pos)) /* Assigment of value for DRVASUP in the SDHC_CA1R register */
#define   SDHC_CA1R_DRVASUP_NO_Val            _UINT32_(0x0)                                        /* (SDHC_CA1R) Driver Type A is Not Supported  */
#define   SDHC_CA1R_DRVASUP_YES_Val           _UINT32_(0x1)                                        /* (SDHC_CA1R) Driver Type A is Supported  */
#define SDHC_CA1R_DRVASUP_NO                  (SDHC_CA1R_DRVASUP_NO_Val << SDHC_CA1R_DRVASUP_Pos)  /* (SDHC_CA1R) Driver Type A is Not Supported Position  */
#define SDHC_CA1R_DRVASUP_YES                 (SDHC_CA1R_DRVASUP_YES_Val << SDHC_CA1R_DRVASUP_Pos) /* (SDHC_CA1R) Driver Type A is Supported Position  */
#define SDHC_CA1R_DRVCSUP_Pos                 _UINT32_(5)                                          /* (SDHC_CA1R) Driver Type C Support Position */
#define SDHC_CA1R_DRVCSUP_Msk                 (_UINT32_(0x1) << SDHC_CA1R_DRVCSUP_Pos)             /* (SDHC_CA1R) Driver Type C Support Mask */
#define SDHC_CA1R_DRVCSUP(value)              (SDHC_CA1R_DRVCSUP_Msk & (_UINT32_(value) << SDHC_CA1R_DRVCSUP_Pos)) /* Assigment of value for DRVCSUP in the SDHC_CA1R register */
#define   SDHC_CA1R_DRVCSUP_NO_Val            _UINT32_(0x0)                                        /* (SDHC_CA1R) Driver Type C is Not Supported  */
#define   SDHC_CA1R_DRVCSUP_YES_Val           _UINT32_(0x1)                                        /* (SDHC_CA1R) Driver Type C is Supported  */
#define SDHC_CA1R_DRVCSUP_NO                  (SDHC_CA1R_DRVCSUP_NO_Val << SDHC_CA1R_DRVCSUP_Pos)  /* (SDHC_CA1R) Driver Type C is Not Supported Position  */
#define SDHC_CA1R_DRVCSUP_YES                 (SDHC_CA1R_DRVCSUP_YES_Val << SDHC_CA1R_DRVCSUP_Pos) /* (SDHC_CA1R) Driver Type C is Supported Position  */
#define SDHC_CA1R_DRVDSUP_Pos                 _UINT32_(6)                                          /* (SDHC_CA1R) Driver Type D Support Position */
#define SDHC_CA1R_DRVDSUP_Msk                 (_UINT32_(0x1) << SDHC_CA1R_DRVDSUP_Pos)             /* (SDHC_CA1R) Driver Type D Support Mask */
#define SDHC_CA1R_DRVDSUP(value)              (SDHC_CA1R_DRVDSUP_Msk & (_UINT32_(value) << SDHC_CA1R_DRVDSUP_Pos)) /* Assigment of value for DRVDSUP in the SDHC_CA1R register */
#define   SDHC_CA1R_DRVDSUP_NO_Val            _UINT32_(0x0)                                        /* (SDHC_CA1R) Driver Type D is Not Supported  */
#define   SDHC_CA1R_DRVDSUP_YES_Val           _UINT32_(0x1)                                        /* (SDHC_CA1R) Driver Type D is Supported  */
#define SDHC_CA1R_DRVDSUP_NO                  (SDHC_CA1R_DRVDSUP_NO_Val << SDHC_CA1R_DRVDSUP_Pos)  /* (SDHC_CA1R) Driver Type D is Not Supported Position  */
#define SDHC_CA1R_DRVDSUP_YES                 (SDHC_CA1R_DRVDSUP_YES_Val << SDHC_CA1R_DRVDSUP_Pos) /* (SDHC_CA1R) Driver Type D is Supported Position  */
#define SDHC_CA1R_TCNTRT_Pos                  _UINT32_(8)                                          /* (SDHC_CA1R) Timer Count for Re-Tuning Position */
#define SDHC_CA1R_TCNTRT_Msk                  (_UINT32_(0xF) << SDHC_CA1R_TCNTRT_Pos)              /* (SDHC_CA1R) Timer Count for Re-Tuning Mask */
#define SDHC_CA1R_TCNTRT(value)               (SDHC_CA1R_TCNTRT_Msk & (_UINT32_(value) << SDHC_CA1R_TCNTRT_Pos)) /* Assigment of value for TCNTRT in the SDHC_CA1R register */
#define   SDHC_CA1R_TCNTRT_DISABLED_Val       _UINT32_(0x0)                                        /* (SDHC_CA1R) Re-Tuning Timer disabled  */
#define   SDHC_CA1R_TCNTRT_1S_Val             _UINT32_(0x1)                                        /* (SDHC_CA1R) 1 second  */
#define   SDHC_CA1R_TCNTRT_2S_Val             _UINT32_(0x2)                                        /* (SDHC_CA1R) 2 seconds  */
#define   SDHC_CA1R_TCNTRT_4S_Val             _UINT32_(0x3)                                        /* (SDHC_CA1R) 4 seconds  */
#define   SDHC_CA1R_TCNTRT_8S_Val             _UINT32_(0x4)                                        /* (SDHC_CA1R) 8 seconds  */
#define   SDHC_CA1R_TCNTRT_16S_Val            _UINT32_(0x5)                                        /* (SDHC_CA1R) 16 seconds  */
#define   SDHC_CA1R_TCNTRT_32S_Val            _UINT32_(0x6)                                        /* (SDHC_CA1R) 32 seconds  */
#define   SDHC_CA1R_TCNTRT_64S_Val            _UINT32_(0x7)                                        /* (SDHC_CA1R) 64 seconds  */
#define   SDHC_CA1R_TCNTRT_128S_Val           _UINT32_(0x8)                                        /* (SDHC_CA1R) 128 seconds  */
#define   SDHC_CA1R_TCNTRT_256S_Val           _UINT32_(0x9)                                        /* (SDHC_CA1R) 256 seconds  */
#define   SDHC_CA1R_TCNTRT_512S_Val           _UINT32_(0xA)                                        /* (SDHC_CA1R) 512 seconds  */
#define   SDHC_CA1R_TCNTRT_1024S_Val          _UINT32_(0xB)                                        /* (SDHC_CA1R) 1024 seconds  */
#define   SDHC_CA1R_TCNTRT_OTHER_Val          _UINT32_(0xF)                                        /* (SDHC_CA1R) Get information from other source  */
#define SDHC_CA1R_TCNTRT_DISABLED             (SDHC_CA1R_TCNTRT_DISABLED_Val << SDHC_CA1R_TCNTRT_Pos) /* (SDHC_CA1R) Re-Tuning Timer disabled Position  */
#define SDHC_CA1R_TCNTRT_1S                   (SDHC_CA1R_TCNTRT_1S_Val << SDHC_CA1R_TCNTRT_Pos)    /* (SDHC_CA1R) 1 second Position  */
#define SDHC_CA1R_TCNTRT_2S                   (SDHC_CA1R_TCNTRT_2S_Val << SDHC_CA1R_TCNTRT_Pos)    /* (SDHC_CA1R) 2 seconds Position  */
#define SDHC_CA1R_TCNTRT_4S                   (SDHC_CA1R_TCNTRT_4S_Val << SDHC_CA1R_TCNTRT_Pos)    /* (SDHC_CA1R) 4 seconds Position  */
#define SDHC_CA1R_TCNTRT_8S                   (SDHC_CA1R_TCNTRT_8S_Val << SDHC_CA1R_TCNTRT_Pos)    /* (SDHC_CA1R) 8 seconds Position  */
#define SDHC_CA1R_TCNTRT_16S                  (SDHC_CA1R_TCNTRT_16S_Val << SDHC_CA1R_TCNTRT_Pos)   /* (SDHC_CA1R) 16 seconds Position  */
#define SDHC_CA1R_TCNTRT_32S                  (SDHC_CA1R_TCNTRT_32S_Val << SDHC_CA1R_TCNTRT_Pos)   /* (SDHC_CA1R) 32 seconds Position  */
#define SDHC_CA1R_TCNTRT_64S                  (SDHC_CA1R_TCNTRT_64S_Val << SDHC_CA1R_TCNTRT_Pos)   /* (SDHC_CA1R) 64 seconds Position  */
#define SDHC_CA1R_TCNTRT_128S                 (SDHC_CA1R_TCNTRT_128S_Val << SDHC_CA1R_TCNTRT_Pos)  /* (SDHC_CA1R) 128 seconds Position  */
#define SDHC_CA1R_TCNTRT_256S                 (SDHC_CA1R_TCNTRT_256S_Val << SDHC_CA1R_TCNTRT_Pos)  /* (SDHC_CA1R) 256 seconds Position  */
#define SDHC_CA1R_TCNTRT_512S                 (SDHC_CA1R_TCNTRT_512S_Val << SDHC_CA1R_TCNTRT_Pos)  /* (SDHC_CA1R) 512 seconds Position  */
#define SDHC_CA1R_TCNTRT_1024S                (SDHC_CA1R_TCNTRT_1024S_Val << SDHC_CA1R_TCNTRT_Pos) /* (SDHC_CA1R) 1024 seconds Position  */
#define SDHC_CA1R_TCNTRT_OTHER                (SDHC_CA1R_TCNTRT_OTHER_Val << SDHC_CA1R_TCNTRT_Pos) /* (SDHC_CA1R) Get information from other source Position  */
#define SDHC_CA1R_TSDR50_Pos                  _UINT32_(13)                                         /* (SDHC_CA1R) Use Tuning for SDR50 Position */
#define SDHC_CA1R_TSDR50_Msk                  (_UINT32_(0x1) << SDHC_CA1R_TSDR50_Pos)              /* (SDHC_CA1R) Use Tuning for SDR50 Mask */
#define SDHC_CA1R_TSDR50(value)               (SDHC_CA1R_TSDR50_Msk & (_UINT32_(value) << SDHC_CA1R_TSDR50_Pos)) /* Assigment of value for TSDR50 in the SDHC_CA1R register */
#define   SDHC_CA1R_TSDR50_NO_Val             _UINT32_(0x0)                                        /* (SDHC_CA1R) SDR50 does not require tuning  */
#define   SDHC_CA1R_TSDR50_YES_Val            _UINT32_(0x1)                                        /* (SDHC_CA1R) SDR50 requires tuning  */
#define SDHC_CA1R_TSDR50_NO                   (SDHC_CA1R_TSDR50_NO_Val << SDHC_CA1R_TSDR50_Pos)    /* (SDHC_CA1R) SDR50 does not require tuning Position  */
#define SDHC_CA1R_TSDR50_YES                  (SDHC_CA1R_TSDR50_YES_Val << SDHC_CA1R_TSDR50_Pos)   /* (SDHC_CA1R) SDR50 requires tuning Position  */
#define SDHC_CA1R_CLKMULT_Pos                 _UINT32_(16)                                         /* (SDHC_CA1R) Clock Multiplier Position */
#define SDHC_CA1R_CLKMULT_Msk                 (_UINT32_(0xFF) << SDHC_CA1R_CLKMULT_Pos)            /* (SDHC_CA1R) Clock Multiplier Mask */
#define SDHC_CA1R_CLKMULT(value)              (SDHC_CA1R_CLKMULT_Msk & (_UINT32_(value) << SDHC_CA1R_CLKMULT_Pos)) /* Assigment of value for CLKMULT in the SDHC_CA1R register */
#define   SDHC_CA1R_CLKMULT_NO_Val            _UINT32_(0x0)                                        /* (SDHC_CA1R) Clock Multiplier is Not Supported  */
#define SDHC_CA1R_CLKMULT_NO                  (SDHC_CA1R_CLKMULT_NO_Val << SDHC_CA1R_CLKMULT_Pos)  /* (SDHC_CA1R) Clock Multiplier is Not Supported Position  */
#define SDHC_CA1R_Msk                         _UINT32_(0x00FF2F77)                                 /* (SDHC_CA1R) Register Mask  */

#define SDHC_CA1R_TSDR_Pos                    _UINT32_(13)                                         /* (SDHC_CA1R Position) Use Tuning for SDR5x */
#define SDHC_CA1R_TSDR_Msk                    (_UINT32_(0x1) << SDHC_CA1R_TSDR_Pos)                /* (SDHC_CA1R Mask) TSDR */
#define SDHC_CA1R_TSDR(value)                 (SDHC_CA1R_TSDR_Msk & (_UINT32_(value) << SDHC_CA1R_TSDR_Pos)) 

/* -------- SDHC_MCCAR : (SDHC Offset: 0x48) ( R/ 32) Maximum Current Capabilities -------- */
#define SDHC_MCCAR_RESETVALUE                 _UINT32_(0x00)                                       /*  (SDHC_MCCAR) Maximum Current Capabilities  Reset Value */

