Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/include/component/sdhc.h
#define SDHC_FEREIS_CMDTEO_Pos                _UINT16_(0)                                          /* (SDHC_FEREIS) Force Event for Command Timeout Error Position */
#define SDHC_FEREIS_CMDTEO_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDTEO_Pos)            /* (SDHC_FEREIS) Force Event for Command Timeout Error Mask */
#define SDHC_FEREIS_CMDTEO(value)             (SDHC_FEREIS_CMDTEO_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDTEO_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDTEO_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDTEO_NO                 (SDHC_FEREIS_CMDTEO_NO_Val << SDHC_FEREIS_CMDTEO_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDTEO_YES                (SDHC_FEREIS_CMDTEO_YES_Val << SDHC_FEREIS_CMDTEO_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CMDCRC_Pos                _UINT16_(1)                                          /* (SDHC_FEREIS) Force Event for Command CRC Error Position */
#define SDHC_FEREIS_CMDCRC_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDCRC_Pos)            /* (SDHC_FEREIS) Force Event for Command CRC Error Mask */
#define SDHC_FEREIS_CMDCRC(value)             (SDHC_FEREIS_CMDCRC_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDCRC_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDCRC_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDCRC_NO                 (SDHC_FEREIS_CMDCRC_NO_Val << SDHC_FEREIS_CMDCRC_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDCRC_YES                (SDHC_FEREIS_CMDCRC_YES_Val << SDHC_FEREIS_CMDCRC_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CMDEND_Pos                _UINT16_(2)                                          /* (SDHC_FEREIS) Force Event for Command End Bit Error Position */
#define SDHC_FEREIS_CMDEND_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDEND_Pos)            /* (SDHC_FEREIS) Force Event for Command End Bit Error Mask */
#define SDHC_FEREIS_CMDEND(value)             (SDHC_FEREIS_CMDEND_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDEND_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDEND_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDEND_NO                 (SDHC_FEREIS_CMDEND_NO_Val << SDHC_FEREIS_CMDEND_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDEND_YES                (SDHC_FEREIS_CMDEND_YES_Val << SDHC_FEREIS_CMDEND_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CMDIDX_Pos                _UINT16_(3)                                          /* (SDHC_FEREIS) Force Event for Command Index Error Position */
#define SDHC_FEREIS_CMDIDX_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CMDIDX_Pos)            /* (SDHC_FEREIS) Force Event for Command Index Error Mask */
#define SDHC_FEREIS_CMDIDX(value)             (SDHC_FEREIS_CMDIDX_Msk & (_UINT16_(value) << SDHC_FEREIS_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CMDIDX_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CMDIDX_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CMDIDX_NO                 (SDHC_FEREIS_CMDIDX_NO_Val << SDHC_FEREIS_CMDIDX_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CMDIDX_YES                (SDHC_FEREIS_CMDIDX_YES_Val << SDHC_FEREIS_CMDIDX_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_DATTEO_Pos                _UINT16_(4)                                          /* (SDHC_FEREIS) Force Event for Data Timeout Error Position */
#define SDHC_FEREIS_DATTEO_Msk                (_UINT16_(0x1) << SDHC_FEREIS_DATTEO_Pos)            /* (SDHC_FEREIS) Force Event for Data Timeout Error Mask */
#define SDHC_FEREIS_DATTEO(value)             (SDHC_FEREIS_DATTEO_Msk & (_UINT16_(value) << SDHC_FEREIS_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDHC_FEREIS register */
#define   SDHC_FEREIS_DATTEO_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_DATTEO_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_DATTEO_NO                 (SDHC_FEREIS_DATTEO_NO_Val << SDHC_FEREIS_DATTEO_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_DATTEO_YES                (SDHC_FEREIS_DATTEO_YES_Val << SDHC_FEREIS_DATTEO_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_DATCRC_Pos                _UINT16_(5)                                          /* (SDHC_FEREIS) Force Event for Data CRC Error Position */
#define SDHC_FEREIS_DATCRC_Msk                (_UINT16_(0x1) << SDHC_FEREIS_DATCRC_Pos)            /* (SDHC_FEREIS) Force Event for Data CRC Error Mask */
#define SDHC_FEREIS_DATCRC(value)             (SDHC_FEREIS_DATCRC_Msk & (_UINT16_(value) << SDHC_FEREIS_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDHC_FEREIS register */
#define   SDHC_FEREIS_DATCRC_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_DATCRC_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_DATCRC_NO                 (SDHC_FEREIS_DATCRC_NO_Val << SDHC_FEREIS_DATCRC_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_DATCRC_YES                (SDHC_FEREIS_DATCRC_YES_Val << SDHC_FEREIS_DATCRC_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_DATEND_Pos                _UINT16_(6)                                          /* (SDHC_FEREIS) Force Event for Data End Bit Error Position */
#define SDHC_FEREIS_DATEND_Msk                (_UINT16_(0x1) << SDHC_FEREIS_DATEND_Pos)            /* (SDHC_FEREIS) Force Event for Data End Bit Error Mask */
#define SDHC_FEREIS_DATEND(value)             (SDHC_FEREIS_DATEND_Msk & (_UINT16_(value) << SDHC_FEREIS_DATEND_Pos)) /* Assigment of value for DATEND in the SDHC_FEREIS register */
#define   SDHC_FEREIS_DATEND_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_DATEND_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_DATEND_NO                 (SDHC_FEREIS_DATEND_NO_Val << SDHC_FEREIS_DATEND_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_DATEND_YES                (SDHC_FEREIS_DATEND_YES_Val << SDHC_FEREIS_DATEND_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_CURLIM_Pos                _UINT16_(7)                                          /* (SDHC_FEREIS) Force Event for Current Limit Error Position */
#define SDHC_FEREIS_CURLIM_Msk                (_UINT16_(0x1) << SDHC_FEREIS_CURLIM_Pos)            /* (SDHC_FEREIS) Force Event for Current Limit Error Mask */
#define SDHC_FEREIS_CURLIM(value)             (SDHC_FEREIS_CURLIM_Msk & (_UINT16_(value) << SDHC_FEREIS_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDHC_FEREIS register */
#define   SDHC_FEREIS_CURLIM_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_CURLIM_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_CURLIM_NO                 (SDHC_FEREIS_CURLIM_NO_Val << SDHC_FEREIS_CURLIM_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_CURLIM_YES                (SDHC_FEREIS_CURLIM_YES_Val << SDHC_FEREIS_CURLIM_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_ACMD_Pos                  _UINT16_(8)                                          /* (SDHC_FEREIS) Force Event for Auto CMD Error Position */
#define SDHC_FEREIS_ACMD_Msk                  (_UINT16_(0x1) << SDHC_FEREIS_ACMD_Pos)              /* (SDHC_FEREIS) Force Event for Auto CMD Error Mask */
#define SDHC_FEREIS_ACMD(value)               (SDHC_FEREIS_ACMD_Msk & (_UINT16_(value) << SDHC_FEREIS_ACMD_Pos)) /* Assigment of value for ACMD in the SDHC_FEREIS register */
#define   SDHC_FEREIS_ACMD_NO_Val             _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_ACMD_YES_Val            _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_ACMD_NO                   (SDHC_FEREIS_ACMD_NO_Val << SDHC_FEREIS_ACMD_Pos)    /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_ACMD_YES                  (SDHC_FEREIS_ACMD_YES_Val << SDHC_FEREIS_ACMD_Pos)   /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_ADMA_Pos                  _UINT16_(9)                                          /* (SDHC_FEREIS) Force Event for ADMA Error Position */
#define SDHC_FEREIS_ADMA_Msk                  (_UINT16_(0x1) << SDHC_FEREIS_ADMA_Pos)              /* (SDHC_FEREIS) Force Event for ADMA Error Mask */
#define SDHC_FEREIS_ADMA(value)               (SDHC_FEREIS_ADMA_Msk & (_UINT16_(value) << SDHC_FEREIS_ADMA_Pos)) /* Assigment of value for ADMA in the SDHC_FEREIS register */
#define   SDHC_FEREIS_ADMA_NO_Val             _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_ADMA_YES_Val            _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_ADMA_NO                   (SDHC_FEREIS_ADMA_NO_Val << SDHC_FEREIS_ADMA_Pos)    /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_ADMA_YES                  (SDHC_FEREIS_ADMA_YES_Val << SDHC_FEREIS_ADMA_Pos)   /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_BOOTAE_Pos                _UINT16_(12)                                         /* (SDHC_FEREIS) Force Event for Boot Acknowledge Error Position */
#define SDHC_FEREIS_BOOTAE_Msk                (_UINT16_(0x1) << SDHC_FEREIS_BOOTAE_Pos)            /* (SDHC_FEREIS) Force Event for Boot Acknowledge Error Mask */
#define SDHC_FEREIS_BOOTAE(value)             (SDHC_FEREIS_BOOTAE_Msk & (_UINT16_(value) << SDHC_FEREIS_BOOTAE_Pos)) /* Assigment of value for BOOTAE in the SDHC_FEREIS register */
#define   SDHC_FEREIS_BOOTAE_NO_Val           _UINT16_(0x0)                                        /* (SDHC_FEREIS) No Interrupt  */
#define   SDHC_FEREIS_BOOTAE_YES_Val          _UINT16_(0x1)                                        /* (SDHC_FEREIS) Interrupt is generated  */
#define SDHC_FEREIS_BOOTAE_NO                 (SDHC_FEREIS_BOOTAE_NO_Val << SDHC_FEREIS_BOOTAE_Pos) /* (SDHC_FEREIS) No Interrupt Position  */
#define SDHC_FEREIS_BOOTAE_YES                (SDHC_FEREIS_BOOTAE_YES_Val << SDHC_FEREIS_BOOTAE_Pos) /* (SDHC_FEREIS) Interrupt is generated Position  */
#define SDHC_FEREIS_Msk                       _UINT16_(0x13FF)                                     /* (SDHC_FEREIS) Register Mask  */


/* -------- SDHC_AESR : (SDHC Offset: 0x54) ( R/ 8) ADMA Error Status -------- */
#define SDHC_AESR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_AESR) ADMA Error Status  Reset Value */

#define SDHC_AESR_ERRST_Pos                   _UINT8_(0)                                           /* (SDHC_AESR) ADMA Error State Position */
#define SDHC_AESR_ERRST_Msk                   (_UINT8_(0x3) << SDHC_AESR_ERRST_Pos)                /* (SDHC_AESR) ADMA Error State Mask */
#define SDHC_AESR_ERRST(value)                (SDHC_AESR_ERRST_Msk & (_UINT8_(value) << SDHC_AESR_ERRST_Pos)) /* Assigment of value for ERRST in the SDHC_AESR register */
#define   SDHC_AESR_ERRST_STOP_Val            _UINT8_(0x0)                                         /* (SDHC_AESR) ST_STOP (Stop DMA)  */
#define   SDHC_AESR_ERRST_FDS_Val             _UINT8_(0x1)                                         /* (SDHC_AESR) ST_FDS (Fetch Descriptor)  */
#define   SDHC_AESR_ERRST_TFR_Val             _UINT8_(0x3)                                         /* (SDHC_AESR) ST_TFR (Transfer Data)  */
#define SDHC_AESR_ERRST_STOP                  (SDHC_AESR_ERRST_STOP_Val << SDHC_AESR_ERRST_Pos)    /* (SDHC_AESR) ST_STOP (Stop DMA) Position  */
#define SDHC_AESR_ERRST_FDS                   (SDHC_AESR_ERRST_FDS_Val << SDHC_AESR_ERRST_Pos)     /* (SDHC_AESR) ST_FDS (Fetch Descriptor) Position  */
#define SDHC_AESR_ERRST_TFR                   (SDHC_AESR_ERRST_TFR_Val << SDHC_AESR_ERRST_Pos)     /* (SDHC_AESR) ST_TFR (Transfer Data) Position  */
#define SDHC_AESR_LMIS_Pos                    _UINT8_(2)                                           /* (SDHC_AESR) ADMA Length Mismatch Error Position */
#define SDHC_AESR_LMIS_Msk                    (_UINT8_(0x1) << SDHC_AESR_LMIS_Pos)                 /* (SDHC_AESR) ADMA Length Mismatch Error Mask */
#define SDHC_AESR_LMIS(value)                 (SDHC_AESR_LMIS_Msk & (_UINT8_(value) << SDHC_AESR_LMIS_Pos)) /* Assigment of value for LMIS in the SDHC_AESR register */
#define   SDHC_AESR_LMIS_NO_Val               _UINT8_(0x0)                                         /* (SDHC_AESR) No Error  */
#define   SDHC_AESR_LMIS_YES_Val              _UINT8_(0x1)                                         /* (SDHC_AESR) Error  */
#define SDHC_AESR_LMIS_NO                     (SDHC_AESR_LMIS_NO_Val << SDHC_AESR_LMIS_Pos)        /* (SDHC_AESR) No Error Position  */
#define SDHC_AESR_LMIS_YES                    (SDHC_AESR_LMIS_YES_Val << SDHC_AESR_LMIS_Pos)       /* (SDHC_AESR) Error Position  */
#define SDHC_AESR_Msk                         _UINT8_(0x07)                                        /* (SDHC_AESR) Register Mask  */


/* -------- SDHC_ASAR : (SDHC Offset: 0x58) (R/W 32) ADMA System Address -------- */
#define SDHC_ASAR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_ASAR) ADMA System Address  Reset Value */

#define SDHC_ASAR_ADMASA_Pos                  _UINT32_(0)                                          /* (SDHC_ASAR) ADMA System Address Position */
#define SDHC_ASAR_ADMASA_Msk                  (_UINT32_(0xFFFFFFFF) << SDHC_ASAR_ADMASA_Pos)       /* (SDHC_ASAR) ADMA System Address Mask */
#define SDHC_ASAR_ADMASA(value)               (SDHC_ASAR_ADMASA_Msk & (_UINT32_(value) << SDHC_ASAR_ADMASA_Pos)) /* Assigment of value for ADMASA in the SDHC_ASAR register */
#define SDHC_ASAR_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SDHC_ASAR) Register Mask  */


/* -------- SDHC_PVR : (SDHC Offset: 0x60) (R/W 16) Preset Value n -------- */
#define SDHC_PVR_RESETVALUE                   _UINT16_(0x00)                                       /*  (SDHC_PVR) Preset Value n  Reset Value */

#define SDHC_PVR_SDCLKFSEL_Pos                _UINT16_(0)                                          /* (SDHC_PVR) SDCLK Frequency Select Value for Initialization Position */
#define SDHC_PVR_SDCLKFSEL_Msk                (_UINT16_(0x3FF) << SDHC_PVR_SDCLKFSEL_Pos)          /* (SDHC_PVR) SDCLK Frequency Select Value for Initialization Mask */
#define SDHC_PVR_SDCLKFSEL(value)             (SDHC_PVR_SDCLKFSEL_Msk & (_UINT16_(value) << SDHC_PVR_SDCLKFSEL_Pos)) /* Assigment of value for SDCLKFSEL in the SDHC_PVR register */
#define SDHC_PVR_CLKGSEL_Pos                  _UINT16_(10)                                         /* (SDHC_PVR) Clock Generator Select Value for Initialization Position */
#define SDHC_PVR_CLKGSEL_Msk                  (_UINT16_(0x1) << SDHC_PVR_CLKGSEL_Pos)              /* (SDHC_PVR) Clock Generator Select Value for Initialization Mask */
#define SDHC_PVR_CLKGSEL(value)               (SDHC_PVR_CLKGSEL_Msk & (_UINT16_(value) << SDHC_PVR_CLKGSEL_Pos)) /* Assigment of value for CLKGSEL in the SDHC_PVR register */
#define   SDHC_PVR_CLKGSEL_DIV_Val            _UINT16_(0x0)                                        /* (SDHC_PVR) Host Controller Ver2.00 Compatible Clock Generator (Divider)  */
#define   SDHC_PVR_CLKGSEL_PROG_Val           _UINT16_(0x1)                                        /* (SDHC_PVR) Programmable Clock Generator  */
#define SDHC_PVR_CLKGSEL_DIV                  (SDHC_PVR_CLKGSEL_DIV_Val << SDHC_PVR_CLKGSEL_Pos)   /* (SDHC_PVR) Host Controller Ver2.00 Compatible Clock Generator (Divider) Position  */
#define SDHC_PVR_CLKGSEL_PROG                 (SDHC_PVR_CLKGSEL_PROG_Val << SDHC_PVR_CLKGSEL_Pos)  /* (SDHC_PVR) Programmable Clock Generator Position  */
#define SDHC_PVR_DRVSEL_Pos                   _UINT16_(14)                                         /* (SDHC_PVR) Driver Strength Select Value for Initialization Position */
#define SDHC_PVR_DRVSEL_Msk                   (_UINT16_(0x3) << SDHC_PVR_DRVSEL_Pos)               /* (SDHC_PVR) Driver Strength Select Value for Initialization Mask */
#define SDHC_PVR_DRVSEL(value)                (SDHC_PVR_DRVSEL_Msk & (_UINT16_(value) << SDHC_PVR_DRVSEL_Pos)) /* Assigment of value for DRVSEL in the SDHC_PVR register */
#define   SDHC_PVR_DRVSEL_B_Val               _UINT16_(0x0)                                        /* (SDHC_PVR) Driver Type B is Selected  */
#define   SDHC_PVR_DRVSEL_A_Val               _UINT16_(0x1)                                        /* (SDHC_PVR) Driver Type A is Selected  */
#define   SDHC_PVR_DRVSEL_C_Val               _UINT16_(0x2)                                        /* (SDHC_PVR) Driver Type C is Selected  */
#define   SDHC_PVR_DRVSEL_D_Val               _UINT16_(0x3)                                        /* (SDHC_PVR) Driver Type D is Selected  */
#define SDHC_PVR_DRVSEL_B                     (SDHC_PVR_DRVSEL_B_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type B is Selected Position  */
#define SDHC_PVR_DRVSEL_A                     (SDHC_PVR_DRVSEL_A_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type A is Selected Position  */
#define SDHC_PVR_DRVSEL_C                     (SDHC_PVR_DRVSEL_C_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type C is Selected Position  */
#define SDHC_PVR_DRVSEL_D                     (SDHC_PVR_DRVSEL_D_Val << SDHC_PVR_DRVSEL_Pos)       /* (SDHC_PVR) Driver Type D is Selected Position  */
#define SDHC_PVR_Msk                          _UINT16_(0xC7FF)                                     /* (SDHC_PVR) Register Mask  */


/* -------- SDHC_SISR : (SDHC Offset: 0xFC) ( R/ 16) Slot Interrupt Status -------- */
#define SDHC_SISR_RESETVALUE                  _UINT16_(0x00)                                       /*  (SDHC_SISR) Slot Interrupt Status  Reset Value */

#define SDHC_SISR_INTSSL_Pos                  _UINT16_(0)                                          /* (SDHC_SISR) Interrupt Signal for Each SDHC Slot Position */
#define SDHC_SISR_INTSSL_Msk                  (_UINT16_(0x3) << SDHC_SISR_INTSSL_Pos)              /* (SDHC_SISR) Interrupt Signal for Each SDHC Slot Mask */
#define SDHC_SISR_INTSSL(value)               (SDHC_SISR_INTSSL_Msk & (_UINT16_(value) << SDHC_SISR_INTSSL_Pos)) /* Assigment of value for INTSSL in the SDHC_SISR register */
#define SDHC_SISR_Msk                         _UINT16_(0x0003)                                     /* (SDHC_SISR) Register Mask  */


