Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG60_DFP/1.1.122/include/component/sdhc.h
/* -------- SDHC_MC2R : (SDHC Offset: 0x205) ( /W 8) MMC Control 2 -------- */
#define SDHC_MC2R_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_MC2R) MMC Control 2  Reset Value */

#define SDHC_MC2R_SRESP_Pos                   _UINT8_(0)                                           /* (SDHC_MC2R) e.MMC Abort Wait IRQ Position */
#define SDHC_MC2R_SRESP_Msk                   (_UINT8_(0x1) << SDHC_MC2R_SRESP_Pos)                /* (SDHC_MC2R) e.MMC Abort Wait IRQ Mask */
#define SDHC_MC2R_SRESP(value)                (SDHC_MC2R_SRESP_Msk & (_UINT8_(value) << SDHC_MC2R_SRESP_Pos)) /* Assigment of value for SRESP in the SDHC_MC2R register */
#define SDHC_MC2R_ABOOT_Pos                   _UINT8_(1)                                           /* (SDHC_MC2R) e.MMC Abort Boot Position */
#define SDHC_MC2R_ABOOT_Msk                   (_UINT8_(0x1) << SDHC_MC2R_ABOOT_Pos)                /* (SDHC_MC2R) e.MMC Abort Boot Mask */
#define SDHC_MC2R_ABOOT(value)                (SDHC_MC2R_ABOOT_Msk & (_UINT8_(value) << SDHC_MC2R_ABOOT_Pos)) /* Assigment of value for ABOOT in the SDHC_MC2R register */
#define SDHC_MC2R_Msk                         _UINT8_(0x03)                                        /* (SDHC_MC2R) Register Mask  */


/* -------- SDHC_ACR : (SDHC Offset: 0x208) (R/W 32) AHB Control -------- */
#define SDHC_ACR_RESETVALUE                   _UINT32_(0x00)                                       /*  (SDHC_ACR) AHB Control  Reset Value */

#define SDHC_ACR_BMAX_Pos                     _UINT32_(0)                                          /* (SDHC_ACR) AHB Maximum Burst Position */
#define SDHC_ACR_BMAX_Msk                     (_UINT32_(0x3) << SDHC_ACR_BMAX_Pos)                 /* (SDHC_ACR) AHB Maximum Burst Mask */
#define SDHC_ACR_BMAX(value)                  (SDHC_ACR_BMAX_Msk & (_UINT32_(value) << SDHC_ACR_BMAX_Pos)) /* Assigment of value for BMAX in the SDHC_ACR register */
#define   SDHC_ACR_BMAX_INCR16_Val            _UINT32_(0x0)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR8_Val             _UINT32_(0x1)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_INCR4_Val             _UINT32_(0x2)                                        /* (SDHC_ACR)   */
#define   SDHC_ACR_BMAX_SINGLE_Val            _UINT32_(0x3)                                        /* (SDHC_ACR)   */
#define SDHC_ACR_BMAX_INCR16                  (SDHC_ACR_BMAX_INCR16_Val << SDHC_ACR_BMAX_Pos)      /* (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_INCR8                   (SDHC_ACR_BMAX_INCR8_Val << SDHC_ACR_BMAX_Pos)       /* (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_INCR4                   (SDHC_ACR_BMAX_INCR4_Val << SDHC_ACR_BMAX_Pos)       /* (SDHC_ACR)  Position  */
#define SDHC_ACR_BMAX_SINGLE                  (SDHC_ACR_BMAX_SINGLE_Val << SDHC_ACR_BMAX_Pos)      /* (SDHC_ACR)  Position  */
#define SDHC_ACR_Msk                          _UINT32_(0x00000003)                                 /* (SDHC_ACR) Register Mask  */


/* -------- SDHC_CC2R : (SDHC Offset: 0x20C) (R/W 32) Clock Control 2 -------- */
#define SDHC_CC2R_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_CC2R) Clock Control 2  Reset Value */

#define SDHC_CC2R_FSDCLKD_Pos                 _UINT32_(0)                                          /* (SDHC_CC2R) Force SDCK Disabled Position */
#define SDHC_CC2R_FSDCLKD_Msk                 (_UINT32_(0x1) << SDHC_CC2R_FSDCLKD_Pos)             /* (SDHC_CC2R) Force SDCK Disabled Mask */
#define SDHC_CC2R_FSDCLKD(value)              (SDHC_CC2R_FSDCLKD_Msk & (_UINT32_(value) << SDHC_CC2R_FSDCLKD_Pos)) /* Assigment of value for FSDCLKD in the SDHC_CC2R register */
#define   SDHC_CC2R_FSDCLKD_NOEFFECT_Val      _UINT32_(0x0)                                        /* (SDHC_CC2R) No effect  */
#define   SDHC_CC2R_FSDCLKD_DISABLE_Val       _UINT32_(0x1)                                        /* (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled  */
#define SDHC_CC2R_FSDCLKD_NOEFFECT            (SDHC_CC2R_FSDCLKD_NOEFFECT_Val << SDHC_CC2R_FSDCLKD_Pos) /* (SDHC_CC2R) No effect Position  */
#define SDHC_CC2R_FSDCLKD_DISABLE             (SDHC_CC2R_FSDCLKD_DISABLE_Val << SDHC_CC2R_FSDCLKD_Pos) /* (SDHC_CC2R) SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled Position  */
#define SDHC_CC2R_Msk                         _UINT32_(0x00000001)                                 /* (SDHC_CC2R) Register Mask  */


/* -------- SDHC_CACR : (SDHC Offset: 0x230) (R/W 32) Capabilities Control -------- */
#define SDHC_CACR_RESETVALUE                  _UINT32_(0x00)                                       /*  (SDHC_CACR) Capabilities Control  Reset Value */

#define SDHC_CACR_CAPWREN_Pos                 _UINT32_(0)                                          /* (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Position */
#define SDHC_CACR_CAPWREN_Msk                 (_UINT32_(0x1) << SDHC_CACR_CAPWREN_Pos)             /* (SDHC_CACR) Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers) Mask */
#define SDHC_CACR_CAPWREN(value)              (SDHC_CACR_CAPWREN_Msk & (_UINT32_(value) << SDHC_CACR_CAPWREN_Pos)) /* Assigment of value for CAPWREN in the SDHC_CACR register */
#define SDHC_CACR_KEY_Pos                     _UINT32_(8)                                          /* (SDHC_CACR) Key (0x46) Position */
#define SDHC_CACR_KEY_Msk                     (_UINT32_(0xFF) << SDHC_CACR_KEY_Pos)                /* (SDHC_CACR) Key (0x46) Mask */
#define SDHC_CACR_KEY(value)                  (SDHC_CACR_KEY_Msk & (_UINT32_(value) << SDHC_CACR_KEY_Pos)) /* Assigment of value for KEY in the SDHC_CACR register */
#define   SDHC_CACR_KEY_KEY_Val               _UINT32_(0x46)                                       /* (SDHC_CACR) Key  */
#define SDHC_CACR_KEY_KEY                     (SDHC_CACR_KEY_KEY_Val << SDHC_CACR_KEY_Pos)         /* (SDHC_CACR) Key Position  */
#define SDHC_CACR_Msk                         _UINT32_(0x0000FF01)                                 /* (SDHC_CACR) Register Mask  */


/* -------- SDHC_DBGR : (SDHC Offset: 0x234) (R/W 8) Debug -------- */
#define SDHC_DBGR_RESETVALUE                  _UINT8_(0x00)                                        /*  (SDHC_DBGR) Debug  Reset Value */

#define SDHC_DBGR_NIDBG_Pos                   _UINT8_(0)                                           /* (SDHC_DBGR) Non-intrusive debug enable Position */
#define SDHC_DBGR_NIDBG_Msk                   (_UINT8_(0x1) << SDHC_DBGR_NIDBG_Pos)                /* (SDHC_DBGR) Non-intrusive debug enable Mask */
#define SDHC_DBGR_NIDBG(value)                (SDHC_DBGR_NIDBG_Msk & (_UINT8_(value) << SDHC_DBGR_NIDBG_Pos)) /* Assigment of value for NIDBG in the SDHC_DBGR register */
#define   SDHC_DBGR_NIDBG_IDBG_Val            _UINT8_(0x0)                                         /* (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)  */
#define   SDHC_DBGR_NIDBG_NIDBG_Val           _UINT8_(0x1)                                         /* (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)  */
#define SDHC_DBGR_NIDBG_IDBG                  (SDHC_DBGR_NIDBG_IDBG_Val << SDHC_DBGR_NIDBG_Pos)    /* (SDHC_DBGR) Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer) Position  */
#define SDHC_DBGR_NIDBG_NIDBG                 (SDHC_DBGR_NIDBG_NIDBG_Val << SDHC_DBGR_NIDBG_Pos)   /* (SDHC_DBGR) Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer) Position  */
#define SDHC_DBGR_Msk                         _UINT8_(0x01)                                        /* (SDHC_DBGR) Register Mask  */


/** \brief SDHC register offsets definitions */
#define SDHC_SSAR_REG_OFST             _UINT32_(0x00)      /* (SDHC_SSAR) SDMA System Address / Argument 2 Offset */
#define SDHC_BSR_REG_OFST              _UINT32_(0x04)      /* (SDHC_BSR) Block Size Offset */
#define SDHC_BCR_REG_OFST              _UINT32_(0x06)      /* (SDHC_BCR) Block Count Offset */
#define SDHC_ARG1R_REG_OFST            _UINT32_(0x08)      /* (SDHC_ARG1R) Argument 1 Offset */
#define SDHC_TMR_REG_OFST              _UINT32_(0x0C)      /* (SDHC_TMR) Transfer Mode Offset */
#define SDHC_CR_REG_OFST               _UINT32_(0x0E)      /* (SDHC_CR) Command Offset */
#define SDHC_RR_REG_OFST               _UINT32_(0x10)      /* (SDHC_RR) Response Offset */
#define SDHC_RR0_REG_OFST              _UINT32_(0x10)      /* (SDHC_RR0) Response Offset */
#define SDHC_RR1_REG_OFST              _UINT32_(0x14)      /* (SDHC_RR1) Response Offset */
#define SDHC_RR2_REG_OFST              _UINT32_(0x18)      /* (SDHC_RR2) Response Offset */
#define SDHC_RR3_REG_OFST              _UINT32_(0x1C)      /* (SDHC_RR3) Response Offset */
#define SDHC_BDPR_REG_OFST             _UINT32_(0x20)      /* (SDHC_BDPR) Buffer Data Port Offset */
#define SDHC_PSR_REG_OFST              _UINT32_(0x24)      /* (SDHC_PSR) Present State Offset */
#define SDHC_HC1R_REG_OFST             _UINT32_(0x28)      /* (SDHC_HC1R) Host Control 1 Offset */
#define SDHC_PCR_REG_OFST              _UINT32_(0x29)      /* (SDHC_PCR) Power Control Offset */
#define SDHC_BGCR_REG_OFST             _UINT32_(0x2A)      /* (SDHC_BGCR) Block Gap Control Offset */
#define SDHC_WCR_REG_OFST              _UINT32_(0x2B)      /* (SDHC_WCR) Wakeup Control Offset */
#define SDHC_CCR_REG_OFST              _UINT32_(0x2C)      /* (SDHC_CCR) Clock Control Offset */
#define SDHC_TCR_REG_OFST              _UINT32_(0x2E)      /* (SDHC_TCR) Timeout Control Offset */
#define SDHC_SRR_REG_OFST              _UINT32_(0x2F)      /* (SDHC_SRR) Software Reset Offset */
#define SDHC_NISTR_REG_OFST            _UINT32_(0x30)      /* (SDHC_NISTR) Normal Interrupt Status Offset */
#define SDHC_EISTR_REG_OFST            _UINT32_(0x32)      /* (SDHC_EISTR) Error Interrupt Status Offset */
#define SDHC_NISTER_REG_OFST           _UINT32_(0x34)      /* (SDHC_NISTER) Normal Interrupt Status Enable Offset */
#define SDHC_EISTER_REG_OFST           _UINT32_(0x36)      /* (SDHC_EISTER) Error Interrupt Status Enable Offset */
#define SDHC_NISIER_REG_OFST           _UINT32_(0x38)      /* (SDHC_NISIER) Normal Interrupt Signal Enable Offset */
#define SDHC_EISIER_REG_OFST           _UINT32_(0x3A)      /* (SDHC_EISIER) Error Interrupt Signal Enable Offset */
#define SDHC_ACESR_REG_OFST            _UINT32_(0x3C)      /* (SDHC_ACESR) Auto CMD Error Status Offset */
#define SDHC_HC2R_REG_OFST             _UINT32_(0x3E)      /* (SDHC_HC2R) Host Control 2 Offset */
#define SDHC_CA0R_REG_OFST             _UINT32_(0x40)      /* (SDHC_CA0R) Capabilities 0 Offset */
#define SDHC_CA1R_REG_OFST             _UINT32_(0x44)      /* (SDHC_CA1R) Capabilities 1 Offset */
#define SDHC_MCCAR_REG_OFST            _UINT32_(0x48)      /* (SDHC_MCCAR) Maximum Current Capabilities Offset */
#define SDHC_FERACES_REG_OFST          _UINT32_(0x50)      /* (SDHC_FERACES) Force Event for Auto CMD Error Status Offset */
#define SDHC_FEREIS_REG_OFST           _UINT32_(0x52)      /* (SDHC_FEREIS) Force Event for Error Interrupt Status Offset */
#define SDHC_AESR_REG_OFST             _UINT32_(0x54)      /* (SDHC_AESR) ADMA Error Status Offset */
#define SDHC_ASAR_REG_OFST             _UINT32_(0x58)      /* (SDHC_ASAR) ADMA System Address Offset */
#define SDHC_ASAR0_REG_OFST            _UINT32_(0x58)      /* (SDHC_ASAR0) ADMA System Address Offset */
#define SDHC_PVR_REG_OFST              _UINT32_(0x60)      /* (SDHC_PVR) Preset Value n Offset */
#define SDHC_PVR0_REG_OFST             _UINT32_(0x60)      /* (SDHC_PVR0) Preset Value n Offset */
#define SDHC_PVR1_REG_OFST             _UINT32_(0x62)      /* (SDHC_PVR1) Preset Value n Offset */
#define SDHC_PVR2_REG_OFST             _UINT32_(0x64)      /* (SDHC_PVR2) Preset Value n Offset */
#define SDHC_PVR3_REG_OFST             _UINT32_(0x66)      /* (SDHC_PVR3) Preset Value n Offset */
#define SDHC_PVR4_REG_OFST             _UINT32_(0x68)      /* (SDHC_PVR4) Preset Value n Offset */
#define SDHC_PVR5_REG_OFST             _UINT32_(0x6A)      /* (SDHC_PVR5) Preset Value n Offset */
#define SDHC_PVR6_REG_OFST             _UINT32_(0x6C)      /* (SDHC_PVR6) Preset Value n Offset */
#define SDHC_PVR7_REG_OFST             _UINT32_(0x6E)      /* (SDHC_PVR7) Preset Value n Offset */
#define SDHC_SISR_REG_OFST             _UINT32_(0xFC)      /* (SDHC_SISR) Slot Interrupt Status Offset */
#define SDHC_HCVR_REG_OFST             _UINT32_(0xFE)      /* (SDHC_HCVR) Host Controller Version Offset */
#define SDHC_APSR_REG_OFST             _UINT32_(0x200)     /* (SDHC_APSR) Additional Present State Register Offset */
#define SDHC_MC1R_REG_OFST             _UINT32_(0x204)     /* (SDHC_MC1R) MMC Control 1 Offset */
#define SDHC_MC2R_REG_OFST             _UINT32_(0x205)     /* (SDHC_MC2R) MMC Control 2 Offset */
#define SDHC_ACR_REG_OFST              _UINT32_(0x208)     /* (SDHC_ACR) AHB Control Offset */
#define SDHC_CC2R_REG_OFST             _UINT32_(0x20C)     /* (SDHC_CC2R) Clock Control 2 Offset */
#define SDHC_CACR_REG_OFST             _UINT32_(0x230)     /* (SDHC_CACR) Capabilities Control Offset */
#define SDHC_DBGR_REG_OFST             _UINT32_(0x234)     /* (SDHC_DBGR) Debug Offset */

